<?

$arr = [
    'Московская область' => [
        "Москва", "Подольск", "Зеленоград", "Краснознаменск", "Клин"
    ],
    'Ленинградская область' => [
        "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
    ],
    'Рязанская область' => [
        "Рязань", "Михайлов", "Пронск", "Шилово", "Касимов"
    ],
];

foreach($arr as $obl => $cities) {
    $str .= $obl . ':<br>';
    foreach($cities as $name) {
        if(mb_substr($name, 0, 1) == 'К') {
            $str .= $name . ', ';
        }
    }
    $str = substr_replace($str, '', -2);
    $str .= '<br><br>';
}

echo $str;

